sahil/results/benchmark_results/ordered_opt0_t32_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 1.5625MiB each
200MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     7081.35
    fsyncs/s:                     7081.35

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               110.65

General statistics:
    total time:                          10.0032s
    total number of events:              70849

Latency (ms):
         min:                                    1.71
         avg:                                    4.51
         max:                                   15.95
         95th percentile:                        5.47
         sum:                               319593.33

Threads fairness:
    events (avg/stddev):           2214.0312/5.44
    execution time (avg/stddev):   9.9873/0.00