sahil/results/benchmark_results/ordered_opt1_t16_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3709.01
    fsyncs/s:                     3709.01

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               57.95

General statistics:
    total time:                          10.0022s
    total number of events:              37106

Latency (ms):
         min:                                    1.84
         avg:                                    4.31
         max:                                   13.39
         95th percentile:                        4.74
         sum:                               159760.35

Threads fairness:
    events (avg/stddev):           2319.1250/2.93
    execution time (avg/stddev):   9.9850/0.00