sahil/results/benchmark_results/ordered_opt1_t1_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     463.18
    fsyncs/s:                     463.18

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               7.24

General statistics:
    total time:                          10.0011s
    total number of events:              4633

Latency (ms):
         min:                                    1.66
         avg:                                    2.15
         max:                                   11.67
         95th percentile:                        2.52
         sum:                                 9967.30

Threads fairness:
    events (avg/stddev):           4633.0000/0.00
    execution time (avg/stddev):   9.9673/0.00