sahil/results/benchmark_results/ordered_opt1_t32_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 1.5625MiB each
200MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     6860.63
    fsyncs/s:                     6860.63

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               107.20

General statistics:
    total time:                          10.0024s
    total number of events:              68635

Latency (ms):
         min:                                    1.71
         avg:                                    4.66
         max:                                   27.46
         95th percentile:                        5.77
         sum:                               319539.81

Threads fairness:
    events (avg/stddev):           2144.8438/5.75
    execution time (avg/stddev):   9.9856/0.00