sahil/results/benchmark_results/writeback_opt0_t32_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 1.5625MiB each
200MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     5466.18
    fsyncs/s:                     5466.18

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               85.41

General statistics:
    total time:                          10.0021s
    total number of events:              54677

Latency (ms):
         min:                                    1.73
         avg:                                    5.85
         max:                                  347.94
         95th percentile:                        5.57
         sum:                               319669.99

Threads fairness:
    events (avg/stddev):           1708.6562/4.83
    execution time (avg/stddev):   9.9897/0.00