sahil/results/benchmark_results/writeback_opt0_t8_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1696.36
    fsyncs/s:                     1696.36

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               26.51

General statistics:
    total time:                          10.0024s
    total number of events:              16971

Latency (ms):
         min:                                    1.71
         avg:                                    4.71
         max:                                  123.70
         95th percentile:                        4.57
         sum:                                79874.67

Threads fairness:
    events (avg/stddev):           2121.3750/1.32
    execution time (avg/stddev):   9.9843/0.00